
model.data.validation.HamaCustomer.address                        = La direcci\u00F3n debe tener entre 10 y 100 carateres.
model.data.validation.HamaCustomer.cardnumber                     = El n\u00FAmero de la Tarjeta debe tener entre 10 y 20 n\u00FAmeros. 
model.data.validation.HamaCustomer.email                          = El correo electr\u00F3nico debe tener entre 3 y 255 caracteres.
model.data.validation.HamaCustomer.expirationdate                 = La Fecha de expiraci\u00F3n de la tarjeta solo puede tener 3 n\u00FAmeros
model.data.validation.HamaCustomer.fullname                       = El nombre completo es requerido, y tiene que tener entre 10 y 150 caracteres. 
model.data.validation.HamaCustomer.phone                          = El n\u00FAmero de tel\u00E9fono debe tener entre 9 y 20 n\u00FAmeros m\u00E1ximo.
model.data.validation.HamaCustomerOrder.OrderStatus.StatusOptions = El estatus tiene que ser 'Progress' (en progreso) o 'Finished' (Terminado).
model.data.validation.HamaCustomerOrder.OrderStatus.notnull       = El estatus de la orden no puede ser nulo.
model.data.validation.HamaCustomerOrder.creationdate              = La fecha de creaci\u00F3n no puede ser nula.
model.data.validation.HamaEncryption.textencrypted                = El texto encriptado tiene que tener entre 1 y 255 caracteres.
model.data.validation.HamaEncryption.texttoencrypt                = El texto a encriptar debe tener entre 1 y 50 caracteres.
model.data.validation.HamaLogin.password                          = La constrase\u00F1a debe tener entre 5 y 255 caracteres.
model.data.validation.HamaLogin.username.pattern                  = El nombre de usuario solo puede tener letras, n\u00FAmeros o "_" y "-".
model.data.validation.HamaLogin.username.size                     = El nombre de usuario debe tener entre 3 y 50 caracteres
model.data.validation.HamaOrderLine.priceperunit                  = El precio no puede ser negativo.
model.data.validation.HamaProduct.description                     = La descripci\u00F3n debe tener entre 20 y 800 caracteres.
model.data.validation.HamaProduct.discount.max                    = El descuento no puede exceder el 100%
model.data.validation.HamaProduct.discount.min                    = El descuento deber ser como m\u00EDnimo del 5%
model.data.validation.HamaProduct.images                          = La URL de la imagen debe tener como m\u00EDnimo 5 caracteres.
model.data.validation.HamaProduct.name                            = El nombre del prodcuto debe tener entre 10 a 150 caracteres.
model.data.validation.HamaProduct.price.max                       = El precio no puede exceder 999.99
model.data.validation.HamaProduct.price.min                       = El precio debe de ser por lo menos 0.
model.data.validation.HamaProduct.stock                           = El inventario no puede ser negativo.
model.data.validation.HamaProductFamily.familyname                = Los nombres de las familias de productos solo pueden tener hasta 50 caracteres.
model.data.validation.HamaProductRate.ratename                    = La calificaci\u00F3n del producto puede ser: Muy malo, malo, bueno o muy bueno.
model.data.validation.HamaProvider.address                        = La direcci\u00F3n debe tener entre 10 y 100 caracteres.
model.data.validation.HamaProvider.cif                            = El CIF debe tener entre 9 y 30 Caracteres.
model.data.validation.HamaProvider.email                          = El correo electr\u00F3nico debe tener entre 3 y 255 caracteres. 
model.data.validation.HamaProvider.phone                          = El n\u00FAmero de tel\u00E9fono debe tener entre 9 y 20 n\u00FAmeros.
model.data.validation.HamaProvider.providername                   = El nombre del proveedor debe tener entre 10 y 150 caracteres.
html.generic.errors.message.title                                 = Se han encontrado errores en el formulario.